package scala

object groupby_stu {
  def main(args: Array[String]): Unit = {
//    groupby function study
//    println(List("信计-19.1","信计-19.2","数学-19.2").groupBy(_.split("-")(0)))
//    println(List("信计-19.1","信计-19.2","数学-19.2").groupBy(x=>x.substring(0,x.indexOf("-"))))



//    println(Map("a"->List(1,2,3),"b"->2,"c"->3,"a"->4).groupBy(_._1))
    val map1 = Map("安徽"->"合肥","江苏"->"南京","内蒙古"->"呼和浩特","河北"->"石家庄","河南"->"郑州","山东"->"济南","山西"->"太原","湖北"->"武汉","湖南"->"长沙","广东"->"广州","广西"->"南宁","四川"->"成都","云南"->"昆明","贵州"->"贵阳","福建"->"福州","浙江"->"杭州","江西"->"南昌","辽宁"->"沈阳","吉林"->"长春","黑龙江"->"哈尔滨","陕西"->"西安","甘肃"->"兰州","青海"->"西宁","新疆"->"乌鲁木齐","宁夏"->"银川","西藏"->"拉萨","海南"->"海口","香港"->"香港","澳门"->"澳门","台湾"->"台北")
// 只输出城市名称
    for(map2<-map1){
      print(map2._1+"省省会:")
      println(map2._2)

    }

  }
}
