package scala

object string_pro {
  def main(args: Array[String]): Unit = {
    println("0554-13145".startsWith("0554"))
    println("0554-13145".endsWith("13145"))
    println("0554-13145".contains("13145"))
    println("0554-13145".indexOf("13145")) // 从左往右找,找到返回下标,找不到返回-1
    println("0554-13145".indexOf("13145", 5)) // 从下标5开始找
    println("0554-13145".lastIndexOf("13145"))
    println("0554-13145".substring(0, 4))
    println("0554-13145".replace("13145", "13146"))
    println("0554-13145".split("-")(1))
    println("0554-13145".split("-")(0))
    val string = "3室2厅1卫|南北|高楼层(共6层)|精装|小区环境优美|交通便利|房屋面积:100平米|房屋朝向:南北|房屋类型:普通住宅|房屋户型:3室2厅1卫|房屋楼层:高楼层(共6层)|房屋装修:精装|房屋朝向:南北|房屋面积:100平米|房屋类型:普通住宅|房屋户型:3室2厅1卫|房屋楼层:高楼层(共6层)|房屋装修:精装|房屋朝向:南北|房屋面积:100平米|房屋类型:普通住宅|房屋户型:3室2厅1卫|房屋楼层:高楼层(共6层)|房屋装修:精装|房屋朝向:南北|房屋面积:100平米|房屋类型:普通住宅|房屋户型:3室2厅1卫|房屋楼层:高楼层(共6层)|房屋装修:精装|房屋朝向:南北|房屋面积:100平米|房屋类型:普通住宅|房屋户型:3室2厅1卫|房屋楼层:高楼层(共6层)|房屋装修:精装|房屋朝向:南北|房屋面积:100平米|房屋类型:普通住宅|房屋户"
    println(string.split("\\|")(0)) // 3室2厅1卫
  }
}
